#define _CRT_SECURE_NO_WARNINGS 1
#include<stdio.h>
#include<stdlib.h>
#include<string.h>
#include<time.h>
#include<assert.h>

//原码 反码 补码
//有符号数（负数），无符号数（正数）
//正数三码相同，负数三码不同
//int b=-10
//原码=10000000 00000000 00000000 00001010
//反码=11111111 11111111 11111111 11110101
//补码=1111 1111 1111 1111 1111 1111 1111 0110
//十六进制补码=0x FFFFFFF 6

//4个二进制位可转换成1个十六进制位，十六进制位0x开头
//a=20;
//二进制原码=0000 0000 0000 0000 0000 0000 0001 0100=反码=补码
//十六进制原码=0x 0 0 0 0 0 0 1 4

//int main()
//{
//	int a=1;
//	char* p=(char*)&a;
//	if(*p==1)
//	{
//		printf("小端");
//	}
//	else
//		printf("大端");
//	return 0;
//}


//浮点数存取方式及浮整转型方式
int main()
{
	int n=9;
	//n-bit=00000000 00000000 00000000 00001001
	float* pfloat=(float*)&n;
	//将上二进制位看成32位浮点数
	//nf-bit=0 00000000 00000000000000000001001
	//S=0; E=1-127=-126 ;	M=0.00000000000000000001001;
	//nf=(-1)^0 * 0.00000000000000000001001 * 2^(-126)
	printf("n的值为：%d\n",n);//9
	printf("*pfloat的值为：%f\n",*pfloat);//仅打印6个bit位；

	*pfloat=9.0;
	//int bit=1001
	//float bit=(-1)^S * M *2^E
	//float bit=(-1)^0 * 1.001 *2^3
	//内存中： S=0; E=3+127=130=10000010 ；M=00100000000000000000000
	//pfloat内存中=0 10000010 00100000000000000000000
	printf("num的值为：%d\n",n);//将内存中数看做整型
	//0 10000010 00100000000000000000000=2^30+2^24+2^20=1091567616
	//=0100 0001 0001 0000 0000 0000 0000 0000
	//16内存=0x 4 1 1 00000
	printf("*pfloat的值为：%f\n",*pfloat);
	return 0;
}
